In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.isnull(np.nan)

True

In [3]:
pd.isnull(None)

True

In [4]:
pd.isna(np.nan)

True

In [5]:
pd.isna(None)

True

In [6]:
pd.notnull(None)

False

In [7]:
pd.notnull(np.nan)

False

In [8]:
pd.notna(np.nan)

False

In [9]:
pd.notnull(3)

True

In [10]:
#Esta funciona en Series y Dataframes

In [11]:
pd.isnull(pd.Series([1, np.nan, 7]))

0    False
1     True
2    False
dtype: bool

In [12]:
pd.notnull(pd.Series([1, np.nan, 7]))

0     True
1    False
2     True
dtype: bool

In [13]:
pd.isnull(pd.DataFrame({
    'Ca': [1, np.nan,7],
    'Cb': [np.nan,2,3],
    'Cc': [np.nan,2,np.nan]
}))

      Ca     Cb     Cc
0  False   True   True
1   True  False  False
2  False  False   True

In [14]:
#Operaciones con MV

In [15]:
pd.Series([1,2, np.nan]).count()

2

In [16]:
pd.Series([1,2, np.nan]).sum()

3.0

In [17]:
pd.Series([1,2, np.nan]).mean()

1.5

In [18]:
#Filtering missing data

In [19]:
s = pd.Series([1,2,3, np.nan,np.nan,4])

In [20]:
pd.notnull(s)

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [21]:
pd.isnull(s)

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [23]:
pd.notnull(s).sum()

4

In [24]:
pd.isnull(s).sum()

2

In [25]:
s[pd.notnull(s)]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [26]:
s.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [27]:
s.notnull()

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [28]:
s[s.notnull()]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [29]:
#Dropping null values

In [30]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [31]:
s.dropna()

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [ ]:
#Dropping values in DataFrame

In [34]:
df = pd.DataFrame({
    'Ca': [1, np.nan,30,np.nan],
    'Cb': [2, 8, 31, np.nan],
    'Cc': [np.nan, 9, 32, 100],
    'Cd': [5, 9, 32, 100],
})

In [35]:
df

     Ca    Cb     Cc   Cd
0   1.0   2.0    NaN    5
1   NaN   8.0    9.0    9
2  30.0  31.0   32.0   32
3   NaN   NaN  100.0  100

In [36]:
df.shape

(4, 4)

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Ca      2 non-null      float64
 1   Cb      3 non-null      float64
 2   Cc      3 non-null      float64
 3   Cd      4 non-null      int64
dtypes: float64(3), int64(1)
memory usage: 256.0 bytes

In [38]:
df.isnull()

      Ca     Cb     Cc     Cd
0  False  False   True  False
1   True  False  False  False
2  False  False  False  False
3   True   True  False  False

In [39]:
df.isnull().sum()

Ca    2
Cb    1
Cc    1
Cd    0
dtype: int64

In [40]:
df.dropna()

     Ca    Cb    Cc  Cd
2  30.0  31.0  32.0  32

In [41]:
df.dropna(axis=1)

    Cd
0    5
1    9
2   32
3  100

In [42]:
df2 = pd.DataFrame({
    'Ca': [1, np.nan,30,np.nan],
    'Cb': [2, 8, 31, np.nan],
    'Cc': [np.nan, 9, 32, 100],
    'Cd': [5, 9, 32, 100],
})

In [43]:
df2

     Ca    Cb     Cc   Cd
0   1.0   2.0    NaN    5
1   NaN   8.0    9.0    9
2  30.0  31.0   32.0   32
3   NaN   NaN  100.0  100

In [44]:
df.dropna(how='all')

     Ca    Cb     Cc   Cd
0   1.0   2.0    NaN    5
1   NaN   8.0    9.0    9
2  30.0  31.0   32.0   32
3   NaN   NaN  100.0  100

In [45]:
df.dropna(how='any')

     Ca    Cb    Cc  Cd
2  30.0  31.0  32.0  32

In [46]:
df

     Ca    Cb     Cc   Cd
0   1.0   2.0    NaN    5
1   NaN   8.0    9.0    9
2  30.0  31.0   32.0   32
3   NaN   NaN  100.0  100

In [47]:
df.dropna(thresh=3)

     Ca    Cb    Cc  Cd
0   1.0   2.0   NaN   5
1   NaN   8.0   9.0   9
2  30.0  31.0  32.0  32

In [48]:
df.dropna(thresh=3, axis='columns')

     Cb     Cc   Cd
0   2.0    NaN    5
1   8.0    9.0    9
2  31.0   32.0   32
3   NaN  100.0  100

In [49]:
#Filling null values

In [56]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [51]:
#with arbitrary value

In [52]:
s.fillna(0)

0    1.0
1    2.0
2    3.0
3    0.0
4    0.0
5    4.0
dtype: float64

In [58]:
s.fillna(s.mean())

0    1.0
1    2.0
2    3.0
3    2.5
4    2.5
5    4.0
dtype: float64

In [59]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [60]:
#Filling nulls with contiguous (close) values

In [61]:
s.fillna(method='ffill')

0    1.0
1    2.0
2    3.0
3    3.0
4    3.0
5    4.0
dtype: float64

In [62]:
s.fillna(method='bfill')

0    1.0
1    2.0
2    3.0
3    4.0
4    4.0
5    4.0
dtype: float64

In [63]:
pd.Series([np.nan, 3, np.nan, 9]).fillna(method='ffill')

0    NaN
1    3.0
2    3.0
3    9.0
dtype: float64

In [64]:
pd.Series([1, np.nan, 3, np.nan, np.nan]).fillna(method='bfill')

0    1.0
1    3.0
2    3.0
3    NaN
4    NaN
dtype: float64

In [65]:
#Filling null values on DataFrames

In [66]:
df

     Ca    Cb     Cc   Cd
0   1.0   2.0    NaN    5
1   NaN   8.0    9.0    9
2  30.0  31.0   32.0   32
3   NaN   NaN  100.0  100

In [67]:
df.fillna({'Ca':0,'Cb':99, 'Cc':df['Cc'].mean()})

     Ca    Cb     Cc   Cd
0   1.0   2.0   47.0    5
1   0.0   8.0    9.0    9
2  30.0  31.0   32.0   32
3   0.0  99.0  100.0  100

In [68]:
df.fillna(method='ffill', axis=0)

     Ca    Cb     Cc   Cd
0   1.0   2.0    NaN    5
1   1.0   8.0    9.0    9
2  30.0  31.0   32.0   32
3  30.0  31.0  100.0  100

In [69]:
df.fillna(method='ffill', axis=1)

     Ca    Cb     Cc     Cd
0   1.0   2.0    2.0    5.0
1   NaN   8.0    9.0    9.0
2  30.0  31.0   32.0   32.0
3   NaN   NaN  100.0  100.0

In [70]:
#Checking if there NAs

In [71]:
s.dropna().count()

4

In [72]:
missing_values = len(s.dropna()) !=len(s)
missing_values

True

In [73]:
len(s)

6

In [74]:
s.count()

4

In [77]:
missing_values = s.count() !=len(s)
missing_values

True

In [78]:
#with any

In [79]:
pd.Series([True, False, False]).any()

True

In [80]:
pd.Series([True, False, False]).all()

False

In [81]:
pd.Series([True, True, True]).any()

True

In [82]:
s.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [83]:
pd.Series([1, np.nan]).isnull().any()

True

In [84]:
pd.Series([1, 2]).isnull().any()

False

In [85]:
s.isnull().any()

True

In [89]:
s.isnull().values

array([False, False, False,  True,  True, False])

In [87]:
s.isnull().values.any()

True